w4d1/app/controllers/contacts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    @user = User.find(params["user_id"])

INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Claire"], ["email", "claire@mysite.com"], ["user_id", 2], ["created_at", "2017-02-14 01:45:14.682289"], ["updated_at", "2017-02-14 01:45:14.682289"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save