w4d1/app/controllers/contact_shares_controller.rb

  def create
    @contact_share = ContactShare.new(contact_share_params)
    if @contact_share.save
---
INSERT INTO "contact_shares" ("user_id", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["contact_id", 2], ["created_at", "2017-02-14 01:48:40.203822"], ["updated_at", "2017-02-14 01:48:40.203822"]]